snlkuharlocal/src/DataProcessors/АвтоФормированиеПросрочЗадолжености/АвтоФормированиеПросрочЗадолжености.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АвтоФормированиеПросрочЗадолжености</name>
  <comment>для Вейморта</comment>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ВводОстатковВзаиморасчетов/ВводОстатковВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковВзаиморасчетов</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Взаиморасчеты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <comment>Сумма в валюте договора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <comment>Сумма в валюте упр. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрытогоПериода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <comment>(Общ)</comment>
  <type>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ТипыКоробов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ФР_Коллекции</types>
    <types>CatalogRef.Кассы</types>
    <types>CatalogRef.РайоныДоставки</types>
    <types>CatalogRef.КлассификаторСтранМира</types>
    <types>CatalogRef.Коллекции</types>
    <types>CatalogRef.ФР_ПоловозрастныеПризнаки</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    <types>CatalogRef.ОтсрочкиПлатежа</types>
    <types>EnumRef.ПериодичностьОтчетов</types>
    <types>CatalogRef.ТипыЦен</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>Boolean</types>
    <types>CatalogRef.ТипыСкидок</types>
    <types>CatalogRef.Цвета</types>
    <types>CatalogRef.Размеры</types>
    <types>CatalogRef.Автомобили</types>
    <types>String</types>
    <types>EnumRef.СостояниеДокументов</types>
    <types>CatalogRef.Регионы</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.ПричиныРекламаций</types>
    <types>Date</types>
    <types>CatalogRef.ФР_Бренды</types>
    <types>Number</types>
    <types>EnumRef.ПланФакт</types>
    <types>EnumRef.СостоянияОтчетов</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ФР_НоменклатурныеГруппы</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.АналитикаОтчетов</types>
    <types>CatalogRef.ИБ</types>
    <types>CatalogRef.ВидыОтчетов</types>
    <numberQualifiers>
      <precision>19</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВидПланаПродаж</name>
      <description>Вид плана продаж</description>
      <code>00109</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения</name>
      <description>Вид распределения</description>
      <code>00111</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения2</name>
      <description>Вид распределения 2</description>
      <code>00217</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнейСверки</name>
      <description>Дата последней сверки</description>
      <code>00215</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
    <items>
      <name>КонтрольЛимитаЗадолженности</name>
      <description>Контроль лимита задолженности</description>
      <code>00216</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>КонтрольПросроченнойЗадолженности</name>
      <description>Контроль просроченной задолженности</description>
      <code>00112</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Основной поставщик</description>
      <code>00110</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>СостояниеДокументов</name>
      <description>Состояние документов</description>
      <code>00214</code>
      <type>
        <types>EnumRef.СостояниеДокументов</types>
      </type>
    </items>
    <items>
      <name>ТоварнаяГруппа</name>
      <description>Товарная группа</description>
      <code>00213</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НазначениеСвойства</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

snlkuharlocal/src/DataProcessors/АвтоФормированиеПросрочЗадолжености/ObjectModule.bsl
//Путь для ФТП  //"\\Srvmail1\FTPFolders\exch80\snl"
//

Функция КонтрольПросроченнойЗадолженности(Контрагент) Экспорт
	
	ПросроченнаяЗадолженность=0;
	ВыбКонтрагент=?(ЗначениеЗаполнено(Контрагент.Ведущий),Контрагент.Ведущий,Контрагент);
	ЕстьКонтроль=ПолучитьГрупповоеСвойствоОбъекта(ВыбКонтрагент,ПланыВидовХарактеристик.СвойстваОбъектов.КонтрольПросроченнойЗадолженности);
	
	Запрос=Новый Запрос;	
	Запрос.Текст="	
	|ВЫБРАТЬ	
	|	ВЫБОР КОГДА ВидДвижения=&Приход ТОГДА СуммаВал ИНАЧЕ -СуммаВал КОНЕЦ КАК НепрОтгр,
	|	0 КАК ДолгКон
	|ИЗ РегистрНакопления.Взаиморасчеты
	|ГДЕ
	|	Период<=&Дата2
	//крохин начало 10.02.2016
	//Дата оплаты в регистре "взаиморасчеты", документы закрытого периода в документе "ввод остатков взаиморасчетов"
	//|	И КОНЕЦПЕРИОДА(Регистратор.ДатаОплаты,День) >= &Дата2
	//|	И Регистратор Ссылка Документ.РасходнаяНакладная
	//крохин начало 10.07.2016
			//информация перенесена из измерения в реквизит
	//|	И КОНЕЦПЕРИОДА(ДатаНачалаЗадолженности,День) >= &Дата2
	|	И КОНЕЦПЕРИОДА(Дата_НачалаЗадолженности,День) >= &Дата2
	//крохин конец 10.07.2016
	|	И (Регистратор Ссылка Документ.РасходнаяНакладная ИЛИ Регистратор Ссылка Документ.ВводОстатковВзаиморасчетов)
	//крохин конец 10.02.2016
		//крохин начало 30.09.2011
	//используем только договора продажи
	|	И Договор.ВидДоговора_Новый=&ВидДоговора
	//крохин конец 30.09.2011
	|	И Контрагент=&Контрагент	
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ	
	|	0 КАК НепрОтгр,	
	|	IsNull(СуммаВалКонечныйОстаток,0) КАК ДолгКон
	|ИЗ
	//крохин начало 30.09.2011
	//используем только договора продажи
	//|	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(, &Дата2,Период,,Контрагент=&Контрагент)
	|	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(, &Дата2,Период,,Контрагент=&Контрагент И Договор.ВидДоговора_Новый=&ВидДоговора)
	//крохин конец 30.09.2011
	|ИТОГИ
	|	СУММА(ДолгКон),СУММА(НепрОтгр) 		
	|ПО ОБЩИЕ";	
	
	Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	
	ДатаКонтроля=КонецДня(ТекущаяДата()-24*60*60)-24*60*60*Константы.ЛьготныхДнейКонтроляПросроченнойЗадолженноси.Получить();
	
	Запрос.УстановитьПараметр("Дата2",ДатаКонтроля);
	Запрос.УстановитьПараметр("Контрагент",ВыбКонтрагент);
	//крохин начало 30.09.2011
	//используем только договора продажи
	Запрос.УстановитьПараметр("ВидДоговора",Справочники.ВидыДоговоров.Товары_Продажа);
	//крохин конец 30.09.2011
	
	ПросроченнаяЗадолженность=0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗаписи()=ТипЗаписиЗапроса.ОбщийИтог Тогда	
			ПросроченнаяЗадолженность=Макс(0,Выборка.ДолгКон-Выборка.НепрОтгр);	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
		
	Возврат ПросроченнаяЗадолженность;
	
КонецФункции // КонтрольПросроченнойЗадолженности()

Функция КонтрольЛимитаКредита(Контрагент,КодУзла) Экспорт 
	
	ВыбКонтрагент=?(ЗначениеЗаполнено(Контрагент.Ведущий),Контрагент.Ведущий,Контрагент);
    ЕстьКонтроль=ПолучитьГрупповоеСвойствоОбъекта(ВыбКонтрагент,ПланыВидовХарактеристик.СвойстваОбъектов.КонтрольЛимитаЗадолженности);
		
	Запрос=Новый Запрос;	
	Запрос.Текст="	
	|ВЫБРАТЬ	
	|	КодЦБ,
	|	ВалютаКредита КАК ВалютаРасчетов,
	|	СУММА(ЛимитКредита)	КАК ЛимитКредита,
	|	СУММА(ВЫБОР КОГДА ДопСоглашение ТОГДА ЛимитКредита ИНАЧЕ 0 КОНЕЦ) КАК ЛимитКредитаПоДопСоглашению
	|ИЗ 
	|	Справочник.Договоры	
	|ГДЕ
	|	КодЦБ=&КодЦБ
	|	И НЕ ПометкаУдаления
	|	И НЕ НеИспользовать	
	|СГРУППИРОВАТЬ ПО 
	|	КодЦБ,ВалютаКредита";	
	
	ДатаКонтроля=КонецДня(ТекущаяДата()-24*60*60);
	
	Запрос.УстановитьПараметр("КодЦБ",ВыбКонтрагент.Код);
	
	ВалютаИтогов=ПараметрыСеанса.ВалютаУпр_2009;
	
	ЛимитКредита				= 0;
	ЛимитКредитаПоДопСоглашению = 0;
		
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛимитКредита				= ЛимитКредита					+глПересчет(Выборка.ЛимитКредита,					Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);
		ЛимитКредитаПоДопСоглашению = ЛимитКредитаПоДопСоглашению	+глПересчет(Выборка.ЛимитКредитаПоДопСоглашению,	Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);		
		//крохин начало 25.02.2011
		//оптовикТЦ, лимит всегда 0
		Если Выборка.КодЦБ = "SMN-1118" Тогда
		ЛимитКредита = 0;
		ЛимитКредитаПоДопСоглашению = 0;
		КонецЕсли;
		//крохин конец 25.02.2011
	КонецЦикла;	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Договор,
	|	Договор.ВалютаКредита	КАК ВалютаРасчетов,
	|	СуммаВалОстаток КАК ОбщийДолг,
	|	ВЫБОР КОГДА Договор.ДопСоглашение ТОГДА 1 ИНАЧЕ 0 КОНЕЦ*СуммаВалОстаток КАК ДолгПоДопСоглашению 
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&ДатаКонтроля, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Договор,
	|	Договор.ВалютаКредита	КАК ВалютаРасчетов,
	|	СуммаДокумента 			КАК ОбщийДолг,
	|	ВЫБОР КОГДА Договор.ДопСоглашение ТОГДА 1 ИНАЧЕ 0 КОНЕЦ*СуммаДокумента КАК ДолгПоДопСоглашению 
	|ИЗ
	|	Документ.РасходнаяНакладная
	|ГДЕ
	|	Проведен
	|	И Отгружен=ЗНАЧЕНИЕ(Перечисление.Отгружен.Резерв)
		//крохин начало 25.11.2012
	//РНК по подразделению выгрузки не учитываем
	|	И Склад.Подразделение.КодФизическогоУзла77 <>  &КодУзла
	//крохин конец 25.11.2012
	|	И (
	|		СостояниеНакладной<>ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ВРаботе)
	//|   	ИЛИ Ссылка=&Накладная
	|	) 	
	|	И (
	|	Контрагент.Ведущий	=&Контрагент
	|	ИЛИ Контрагент		=&Контрагент
	|	)";
	
	Запрос.УстановитьПараметр("ДатаКонтроля",	ДатаКонтроля);
	Запрос.УстановитьПараметр("Контрагент",		ВыбКонтрагент);	
	//Запрос.УстановитьПараметр("Накладная",		Накладная);
			//крохин начало 25.11.2012
	//РНК по подразделению выгрузки не учитываем
	Запрос.УстановитьПараметр("КодУзла",		КодУзла);
	//крохин конец 25.11.2012

	
	
	ОбщийДолг=0;
	ДолгПоДопСоглашению=0;
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщийДолг			=ОбщийДолг			+глПересчет(Выборка.ОбщийДолг,			Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);			
		ДолгПоДопСоглашению	=ДолгПоДопСоглашению+глПересчет(Выборка.ДолгПоДопСоглашению,Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);
	КонецЦикла; 
	
	
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Очистить();
	
	ТЗ.Колонки.Добавить("ЛимитКредита",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ЛимитКредитаПоДопСоглашению",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ОбщийДолг",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ДолгПоДопСоглашению",Новый ОписаниеТипов("Число"));
	
	Строка=ТЗ.Добавить();
	Строка.ЛимитКредита=ЛимитКредита;
	Строка.ЛимитКредитаПоДопСоглашению=ЛимитКредитаПоДопСоглашению;
	Строка.ОбщийДолг=ОбщийДолг;
	Строка.ДолгПоДопСоглашению=ДолгПоДопСоглашению;
	 
	
	Возврат Строка;

	
КонецФункции

Процедура СформироватьВэймарт() Экспорт
	
	
	//-----------------------------------------------------------------------------------------------------------
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));     //+++
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
        
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Выгрузка просроченной задолженности. Разрешено для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	//-----------------------------------------------------------------------------------------------------------

	// выгрузка файла xml, для формирования задолженности.
	
	// получаем запрос данных
	// 1 - скписок конрагентов
	
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для Вейморта. Начало... ","Информация");  
	
	СпКонтр=Новый Запрос;
	СпКонтр.Текст="ВЫБРАТЬ
	              |	Контрагенты.Код,
	              |	Контрагенты.Наименование,
	              |	Контрагенты.Ссылка
	              |ИЗ
	              |	Справочник.Контрагенты КАК Контрагенты
	              |ГДЕ
	              |	Контрагенты.ссылка В ИЕРАРХИИ(&группаКонтр)
	              |	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
	СпКонтр.УстановитьПараметр("ГруппаКонтр",Справочники.Контрагенты.НайтиПоКоду("SSP-1682  "));
	//VAR-0339  ) Балыбина ВА   SMN-1725
	
	СписокКонтрагентов=СпКонтр.Выполнить().Выбрать();
	
	
	// заполнение файла;
	
	//Путь="C:\Documents and Settings\nechaeva\Рабочий стол\Вейморт\" ;
	//Путь="\\E-cod\ediconnector2\Stoletov\Price\";
    Путь="\\Srvmail2\FTPFolders$\exch80\snl\TAX\";    //WMR.xml";
	
	Имя="WMR";
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(Путь+Имя+".xml");  //ДиалогСохранения.ПолноеИмяФайла); 
	ДокументДом=Новый ДокументDom("http://v8.1c./8.1/sample91_DOM","Document-Order");
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	// Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ТекущаяДата()));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	РР=1;
	Пока СписокКонтрагентов.Следующий() цикл
		
		ТекСтрока=СписокКонтрагентов;
		Контрагент=ТекСтрока.ссылка;
		//Состояние(текстрока.наименование);
		// получаем просроченную задолженность и общ задолженность.
		// лимит кредита.
		//-------------------
		Лимит=0;  ТекЗад=0;
        ЛимитКредита=0; ЛимитКредитаПоДопСоглашению=0;
		ОбщийДолг=0; ДолгПоДопСоглашению=0;
		Попытка
			ТекЗад=КонтрольПросроченнойЗадолженности(Контрагент);
			Лимит=КонтрольЛимитаКредита(Контрагент,"");
			ЛимитКредита=Лимит.ЛимитКредита;
			ЛимитКредитаПоДопСоглашению=Лимит.ЛимитКредитаПоДопСоглашению;
			ОбщийДолг=Лимит.ОбщийДолг;
			ДолгПоДопСоглашению=Лимит.ДолгПоДопСоглашению;
		Исключение
		КонецПопытки;
		
		Если ТекЗад=0 и ЛимитКредита=0 и ЛимитКредитаПоДопСоглашению=0 и ОбщийДолг=0 и ДолгПоДопСоглашению=0 Тогда
			продолжить;
		конецЕсли;	
        		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		//---------------------------------------------------------
		// заполняем данные по контрагенту.
		
		Элемент=ДокументДом.СоздатьЭлемент("KOD");  //штрихкод
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Код);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
				
		Элемент=ДокументДом.СоздатьЭлемент("NAIM");  // наименование номенклатуры
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Наименование);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		Элемент=ДокументДом.СоздатьЭлемент("LimitKredita");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредита));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("LimitPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредитаПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("ObDolg");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщийДолг));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("DolgPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДолгПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("TekZadol");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекЗад));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		
		РР=РР+1;
		
	КонецЦикла;
	
	//---------------------------------------------------------------
	ЗаписьДом=Новый ЗаписьDom;
	ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
	ЗаписьХМЛ.Закрыть();	
	
	//сообщить("Выполнено!");
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для Вейморта. ...Конец. ","Информация");  
	
	
КонецПроцедуры

Процедура СформироватьКазань() Экспорт
	
	
	//-----------------------------------------------------------------------------------------------------------
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));     //+++
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
        
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Выгрузка просроченной задолженности. Разрешено для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	//-----------------------------------------------------------------------------------------------------------

	// выгрузка файла xml, для формирования задолженности.
	
	// получаем запрос данных
	// 1 - скписок конрагентов
	
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для Казани. Начало... ","Информация");  
	
	СпКонтр=Новый Запрос;
	СпКонтр.Текст="ВЫБРАТЬ
	              |	Контрагенты.Код,
	              |	Контрагенты.Наименование,
	              |	Контрагенты.Ссылка
	              |ИЗ
	              |	Справочник.Контрагенты КАК Контрагенты
	              |ГДЕ
	              |	Контрагенты.ссылка В ИЕРАРХИИ(&группаКонтр)
	              |	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
	СпКонтр.УстановитьПараметр("ГруппаКонтр",Справочники.Контрагенты.НайтиПоКоду("SSP-5770"));
	//VAR-0339  ) Балыбина ВА   SMN-1725
	
	СписокКонтрагентов=СпКонтр.Выполнить().Выбрать();
	
	
	// заполнение файла;
	
	//Путь="C:\Documents and Settings\nechaeva\Рабочий стол\Вейморт\" ;
	//Путь="\\E-cod\ediconnector2\Stoletov\Price\";
    Путь="\\Srvmail2\FTPFolders$\exch80\snl\TAX\";    //WMR.xml";
	
	Имя="KZF";
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(Путь+Имя+".xml");  //ДиалогСохранения.ПолноеИмяФайла); 
	ДокументДом=Новый ДокументDom("http://v8.1c./8.1/sample91_DOM","Document-Order");
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	// Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ТекущаяДата()));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	РР=1;
	Пока СписокКонтрагентов.Следующий() цикл
		
		ТекСтрока=СписокКонтрагентов;
		Контрагент=ТекСтрока.ссылка;
		//Состояние(текстрока.наименование);
		// получаем просроченную задолженность и общ задолженность.
		// лимит кредита.
		//-------------------
		Лимит=0;  ТекЗад=0;
        ЛимитКредита=0; ЛимитКредитаПоДопСоглашению=0;
		ОбщийДолг=0; ДолгПоДопСоглашению=0;
		Попытка
			ТекЗад=КонтрольПросроченнойЗадолженности(Контрагент);
			Лимит=КонтрольЛимитаКредита(Контрагент,"");
			ЛимитКредита=Лимит.ЛимитКредита;
			ЛимитКредитаПоДопСоглашению=Лимит.ЛимитКредитаПоДопСоглашению;
			ОбщийДолг=Лимит.ОбщийДолг;
			ДолгПоДопСоглашению=Лимит.ДолгПоДопСоглашению;
		Исключение
		КонецПопытки;
		
		Если ТекЗад=0 и ЛимитКредита=0 и ЛимитКредитаПоДопСоглашению=0 и ОбщийДолг=0 и ДолгПоДопСоглашению=0 Тогда
			продолжить;
		конецЕсли;	
        		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		//---------------------------------------------------------
		// заполняем данные по контрагенту.
		
		Элемент=ДокументДом.СоздатьЭлемент("KOD");  //штрихкод
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Код);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
				
		Элемент=ДокументДом.СоздатьЭлемент("NAIM");  // наименование номенклатуры
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Наименование);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		Элемент=ДокументДом.СоздатьЭлемент("LimitKredita");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредита));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("LimitPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредитаПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("ObDolg");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщийДолг));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("DolgPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДолгПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("TekZadol");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекЗад));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		
		РР=РР+1;
		
	КонецЦикла;
	
	//---------------------------------------------------------------
	ЗаписьДом=Новый ЗаписьDom;
	ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
	ЗаписьХМЛ.Закрыть();	
	
	//сообщить("Выполнено!");
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для Казани. ...Конец. ","Информация");  
	
	
КонецПроцедуры

Процедура СформироватьСаратов() Экспорт
	
	
	//-----------------------------------------------------------------------------------------------------------
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));     //+++
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
        
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Выгрузка просроченной задолженности. Разрешено для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	//-----------------------------------------------------------------------------------------------------------

	// выгрузка файла xml, для формирования задолженности.
	
	// получаем запрос данных
	// 1 - скписок конрагентов
	
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для Саратова. Начало... ","Информация");  
	
	СпКонтр=Новый Запрос;
	СпКонтр.Текст="ВЫБРАТЬ
	              |	Контрагенты.Код,
	              |	Контрагенты.Наименование,
	              |	Контрагенты.Ссылка
	              |ИЗ
	              |	Справочник.Контрагенты КАК Контрагенты
	              |ГДЕ
	              |	Контрагенты.ссылка В ИЕРАРХИИ(&группаКонтр)
	              |	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
	СпКонтр.УстановитьПараметр("ГруппаКонтр",Справочники.Контрагенты.НайтиПоКоду("SSP-5899"));
	//VAR-0339  ) Балыбина ВА   SMN-1725
	
	СписокКонтрагентов=СпКонтр.Выполнить().Выбрать();
	
	
	// заполнение файла;
	
	//Путь="C:\Documents and Settings\nechaeva\Рабочий стол\Вейморт\" ;
	//Путь="\\E-cod\ediconnector2\Stoletov\Price\";
    Путь="\\Srvmail2\FTPFolders$\exch80\snl\TAX\";    //WMR.xml";
	
	Имя="SRT";
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(Путь+Имя+".xml");  //ДиалогСохранения.ПолноеИмяФайла); 
	ДокументДом=Новый ДокументDom("http://v8.1c./8.1/sample91_DOM","Document-Order");
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	// Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ТекущаяДата()));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	РР=1;
	Пока СписокКонтрагентов.Следующий() цикл
		
		ТекСтрока=СписокКонтрагентов;
		Контрагент=ТекСтрока.ссылка;
		//Состояние(текстрока.наименование);
		// получаем просроченную задолженность и общ задолженность.
		// лимит кредита.
		//-------------------
		Лимит=0;  ТекЗад=0;
        ЛимитКредита=0; ЛимитКредитаПоДопСоглашению=0;
		ОбщийДолг=0; ДолгПоДопСоглашению=0;
		Попытка
			ТекЗад=КонтрольПросроченнойЗадолженности(Контрагент);
			Лимит=КонтрольЛимитаКредита(Контрагент,"");
			ЛимитКредита=Лимит.ЛимитКредита;
			ЛимитКредитаПоДопСоглашению=Лимит.ЛимитКредитаПоДопСоглашению;
			ОбщийДолг=Лимит.ОбщийДолг;
			ДолгПоДопСоглашению=Лимит.ДолгПоДопСоглашению;
		Исключение
		КонецПопытки;
		
		Если ТекЗад=0 и ЛимитКредита=0 и ЛимитКредитаПоДопСоглашению=0 и ОбщийДолг=0 и ДолгПоДопСоглашению=0 Тогда
			продолжить;
		конецЕсли;	
        		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		//---------------------------------------------------------
		// заполняем данные по контрагенту.
		
		Элемент=ДокументДом.СоздатьЭлемент("KOD");  //штрихкод
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Код);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
				
		Элемент=ДокументДом.СоздатьЭлемент("NAIM");  // наименование номенклатуры
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Наименование);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		Элемент=ДокументДом.СоздатьЭлемент("LimitKredita");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредита));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("LimitPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредитаПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("ObDolg");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщийДолг));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("DolgPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДолгПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("TekZadol");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекЗад));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		
		РР=РР+1;
		
	КонецЦикла;
	
	//---------------------------------------------------------------
	ЗаписьДом=Новый ЗаписьDom;
	ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
	ЗаписьХМЛ.Закрыть();	
	
	//сообщить("Выполнено!");
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для Саратова. ...Конец. ","Информация");  
	
	
КонецПроцедуры

Процедура СформироватьВолгоград() Экспорт
	
	
	//-----------------------------------------------------------------------------------------------------------
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));     //+++
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ТекСтрокаСоединения<>СтрокаСоединенияСразрешеннымОбменом тогда
	Если не ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза() тогда
		//Кухарь А.Ю. 31.03.2026 конец
        
		ЗаписатьВЛог("Регламент","Отмена выполнения. Задача: Выгрузка просроченной задолженности. Разрешено для базы: """+СтрокаСоединенияСразрешеннымОбменом+""", тек. база: """+ТекСтрокаСоединения+""" !","Информация");                     
		Возврат;
	КонецЕсли;
	
	//-----------------------------------------------------------------------------------------------------------

	// выгрузка файла xml, для формирования задолженности.
	
	// получаем запрос данных
	// 1 - скписок конрагентов
	
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для Волгограда. Начало... ","Информация");  
	
	СпКонтр=Новый Запрос;
	СпКонтр.Текст="ВЫБРАТЬ
	              |	Контрагенты.Код,
	              |	Контрагенты.Наименование,
	              |	Контрагенты.Ссылка
	              |ИЗ
	              |	Справочник.Контрагенты КАК Контрагенты
	              |ГДЕ
	              |	Контрагенты.ссылка В ИЕРАРХИИ(&группаКонтр)
	              |	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
	СпКонтр.УстановитьПараметр("ГруппаКонтр",Справочники.Контрагенты.НайтиПоКоду("SSP-7368"));
	//VAR-0339  ) Балыбина ВА   SMN-1725
	
	СписокКонтрагентов=СпКонтр.Выполнить().Выбрать();
	
	
	// заполнение файла;
	
	//Путь="C:\Documents and Settings\nechaeva\Рабочий стол\Вейморт\" ;
	//Путь="\\E-cod\ediconnector2\Stoletov\Price\";
    Путь="\\Srvmail2\FTPFolders$\exch80\snl\TAX\";    //WMR.xml";
	
	Имя="VLS";
	
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(Путь+Имя+".xml");  //ДиалогСохранения.ПолноеИмяФайла); 
	ДокументДом=Новый ДокументDom("http://v8.1c./8.1/sample91_DOM","Document-Order");
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	// Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ТекущаяДата()));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	РР=1;
	Пока СписокКонтрагентов.Следующий() цикл
		
		ТекСтрока=СписокКонтрагентов;
		Контрагент=ТекСтрока.ссылка;
		//Состояние(текстрока.наименование);
		// получаем просроченную задолженность и общ задолженность.
		// лимит кредита.
		//-------------------
		Лимит=0;  ТекЗад=0;
        ЛимитКредита=0; ЛимитКредитаПоДопСоглашению=0;
		ОбщийДолг=0; ДолгПоДопСоглашению=0;
		Попытка
			ТекЗад=КонтрольПросроченнойЗадолженности(Контрагент);
			Лимит=КонтрольЛимитаКредита(Контрагент,"");
			ЛимитКредита=Лимит.ЛимитКредита;
			ЛимитКредитаПоДопСоглашению=Лимит.ЛимитКредитаПоДопСоглашению;
			ОбщийДолг=Лимит.ОбщийДолг;
			ДолгПоДопСоглашению=Лимит.ДолгПоДопСоглашению;
		Исключение
		КонецПопытки;
		
		Если ТекЗад=0 и ЛимитКредита=0 и ЛимитКредитаПоДопСоглашению=0 и ОбщийДолг=0 и ДолгПоДопСоглашению=0 Тогда
			продолжить;
		конецЕсли;	
        		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		//---------------------------------------------------------
		// заполняем данные по контрагенту.
		
		Элемент=ДокументДом.СоздатьЭлемент("KOD");  //штрихкод
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Код);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
				
		Элемент=ДокументДом.СоздатьЭлемент("NAIM");  // наименование номенклатуры
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(ТекСтрока.Наименование);                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		Элемент=ДокументДом.СоздатьЭлемент("LimitKredita");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредита));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("LimitPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредитаПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("ObDolg");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщийДолг));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("DolgPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДолгПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("TekZadol");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекЗад));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		
		РР=РР+1;
		
	КонецЦикла;
	
	//---------------------------------------------------------------
	ЗаписьДом=Новый ЗаписьDom;
	ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
	ЗаписьХМЛ.Закрыть();	
	
	//сообщить("Выполнено!");
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для Волгограда. ...Конец. ","Информация");  
	
	
КонецПроцедуры

Процедура СформироватьАвто(КодУзла,ПутьКФайлу,Контрагент) Экспорт
	
	//+++
	//-----------------------------------------------------------------------------------------------------------
	//-----------------------------------------------------------------------------------------------------------

	// выгрузка файла xml, для формирования задолженности.
	
	// получаем запрос данных
	// 1 - скписок конрагентов
	
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж. для "+КодУзла+". Начало... ","Информация");  
	
	СпКонтр=Новый Запрос;
	СпКонтр.Текст="ВЫБРАТЬ
	              |	Контрагенты.Код,
	              |	Контрагенты.Наименование,
	              |	Контрагенты.Ссылка
	              |ИЗ
	              |	Справочник.Контрагенты КАК Контрагенты
	              |ГДЕ
				  //крохин начало 16.06.2011
				  //вместо контрагентов используем код узла менеджера
	           //   |	Контрагенты.ссылка В ИЕРАРХИИ(&группаКонтр)
			      |	Контрагенты.Менеджер.Подразделение.КодФизическогоУзла77 = &КодУзла 
				  | И НЕ Контрагенты.НеИспользовать
				  //крохин начало 29.06.2011
				  | И НЕ Контрагенты.Владелец = &ИнтегральнаяИБ
				  //крохин конец 29.06.2011
				  //крохин конец
	              |	И Контрагенты.ЭтоГруппа = ЛОЖЬ";
				  
	//Катаев+ 17/06/14 Для узла в Семеновском свой запрос для выбора контрагентов
	Если КодУзла = "SEM" Тогда
		СпКонтр.Текст =
		"ВЫБРАТЬ
		|	Контрагенты.Код,
		|	Контрагенты.Наименование,
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(НЕ Контрагенты.НеИспользовать)
		|	И (НЕ Контрагенты.Владелец = &ИнтегральнаяИБ)
		|	И Контрагенты.ЭтоГруппа = ЛОЖЬ
		|	И Контрагенты.Ссылка В ИЕРАРХИИ(&ГруппаКонтрагентов)";
		СпКонтр.УстановитьПараметр("ГруппаКонтрагентов", Контрагент);
	Конецесли;
	//Катаев- 17/06/14
	//ЗаписатьВЛог("Регламент",""+Справочники.Контрагенты.НайтиПоКоду(КодКонтрагента),"Информация");  
			  
//	СпКонтр.УстановитьПараметр("ГруппаКонтр",Справочники.Контрагенты.НайтиПоКоду(Строка(КодКонтрагента)));

		  //крохин начало 16.06.2011
				  //вместо контрагентов используем код узла менеджера
				//      СпКонтр.УстановитьПараметр("ГруппаКонтр",Контрагент);
	СпКонтр.УстановитьПараметр("КодУзла",КодУзла);	
	СпКонтр.УстановитьПараметр("ИнтегральнаяИБ",Справочники.ИБ.НайтиПоКоду("SMN"));
//крохин конец 16.06.2011
	
	СписокКонтрагентов=СпКонтр.Выполнить().Выбрать();
	
	//ЗаписатьВЛог("Регламент",""+СписокКонтрагентов.Количество(),"Информация");  
	
	// заполнение файла;
	  
	Путь=ПутьКФайлу;
		
	Имя=КодУзла;
	
	//ЗаписьХМЛ=Новый ЗаписьXML;
	//ЗаписьХМЛ.ОткрытьФайл(Путь+Имя+".xml");  //ДиалогСохранения.ПолноеИмяФайла); 
	ДокументДом=Новый ДокументDom("http://v8.1c./8.1/sample91_DOM","Document-Order");
	КорневойЭлемент=ДокументДом.ЭлементДокумента;
	// Order-Header ------------------------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	//------------------------------------------------------------
	Элемент2=ДокументДом.СоздатьЭлемент("OrderDate");
	ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент2);
	текстДом=ДокументДом.СоздатьТекстовыйУзел(строка(ТекущаяДата()));
	ТекУзел2.ДобавитьДочерний(ТекстДом);
	//-------------------------
	//    заполнение строк
	//-------------------------
	ЭлементДом=ДокументДом.СоздатьЭлемент("Order-Lines");
	ТекУзел1=КорневойЭлемент.ДобавитьДочерний(ЭлементДом);
	
	РР=1;
	Пока СписокКонтрагентов.Следующий() цикл
		
		ТекСтрока=СписокКонтрагентов;
		Контрагент=ТекСтрока.ссылка;
	//	ЗаписатьВЛог("Регламент",""+Контрагент,"Информация");  

		//#Если Клиент ТОгда
		//Состояние(текстрока.наименование);
		//# КонецЕсли
		// получаем просроченную задолженность и общ задолженность.
		// лимит кредита.
		//-------------------
		Лимит=0;  ТекЗад=0;
        ЛимитКредита=0; ЛимитКредитаПоДопСоглашению=0;
		ОбщийДолг=0; ДолгПоДопСоглашению=0;
		Попытка
			ТекЗад=КонтрольПросроченнойЗадолженности(Контрагент);
		    Лимит=КонтрольЛимитаКредита(Контрагент,КодУзла);
			ЛимитКредита=Лимит.ЛимитКредита;
			ЛимитКредитаПоДопСоглашению=Лимит.ЛимитКредитаПоДопСоглашению;
			ОбщийДолг=Лимит.ОбщийДолг;
			ДолгПоДопСоглашению=Лимит.ДолгПоДопСоглашению;
		Исключение
		КонецПопытки;
		
		Если ТекЗад=0 и ЛимитКредита=0 и ЛимитКредитаПоДопСоглашению=0 и ОбщийДолг=0 и ДолгПоДопСоглашению=0 Тогда
			продолжить;
		конецЕсли;	
        		
		Элемент=ДокументДом.СоздатьЭлемент("Line");
		ТекУзел2=ТекУзел1.ДобавитьДочерний(Элемент);
		//----------------------------------------------
		Элемент=ДокументДом.СоздатьЭлемент("LineNumber");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(рр));                 
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		//---------------------------------------------------------
		// заполняем данные по контрагенту.
		
		Элемент=ДокументДом.СоздатьЭлемент("KOD");  //штрихкод
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.Код));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		//----------------------------------------------------------
				
		Элемент=ДокументДом.СоздатьЭлемент("NAIM");  // наименование номенклатуры
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекСтрока.Наименование));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		Элемент=ДокументДом.СоздатьЭлемент("LimitKredita");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредита));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("LimitPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ЛимитКредитаПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("ObDolg");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ОбщийДолг));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("DolgPoDopSog");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ДолгПоДопСоглашению));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
		
		Элемент=ДокументДом.СоздатьЭлемент("TekZadol");
		ТекУзел3=ТекУзел2.ДобавитьДочерний(Элемент);
		текстДом=ДокументДом.СоздатьТекстовыйУзел(Строка(ТекЗад));                      
		ТекУзел3.ДобавитьДочерний(ТекстДом);
				
		РР=РР+1;
		
	КонецЦикла;
	
	//---------------------------------------------------------------
	ЗаписьХМЛ=Новый ЗаписьXML;
	ЗаписьХМЛ.ОткрытьФайл(Путь+Имя+".xml");  //ДиалогСохранения.ПолноеИмяФайла); 
	
	
	ЗаписьДом=Новый ЗаписьDom;
	ЗаписьДом.Записать(ДокументДом,ЗаписьХМЛ);
	ЗаписьХМЛ.Закрыть();	
	
	//сообщить("Выполнено!");
	ЗаписатьВЛог("Регламент","Автоформирование файла просроч.задолж."+КодУзла+". ...Конец. ","Информация");  
	
КонецПроцедуры




Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
СформироватьВэймарт();
СформироватьКазань();
СформироватьСаратов();
СформироватьВолгоград();

КонецПроцедуры
